# Перед выполнением кода раскомментируйте переменные a, b, c, d (то есть удалите символ комментария # из строк 4 – 8). Это позволит вам протестировать свой код на разных значениях переменной.
# Перед отправкой кода на проверку снова закомментируйте эту строку — система сама подставит разные значения для проверки вашего кода.

a = 8
b = 10
c = 12
d = 18

# Напишите расчёты для рекламной метрики.

# В переменной numerator сохраните результаты подсчётов числителя дроби.

numerator = (-3+a**2)*b-2**3

# В переменной denominator сохраните результаты подсчётов знаменателя дроби.

denominator = c-2*d

# В переменной result сохраните результат деления числителя на знаменатель.

result = numerator/denominator

# Выведите результат вычислений на экран.
print(result)